import re

text = """ Привіт, це Андрій. Мій новий номер: +380501234567 — телефонуй будь-коли. У Оксани ще старий запис: (097) 123-45-67, але він теж працює. Рекламна служба відповідає за номером: 380631234567 (без плюсика). У Віктора два телефони: 050 123 45 67 та +38 (093) 765-43-21. На візитці у Сергія надруковано: 063-111-22-33, хоча краще дзвонити на +38 067 222 33 11. Іноді пишуть скорочено: 0931234567 — теж вірно. """

phone_regex = r"(?:\+?38[\s\-]?)?(?:\(?0\d{2}\)?[\s\-]?)?\d{3}[\s\-]?\d{2}[\s\-]?\d{2}"

phone_numbers = re.findall(phone_regex, text)


print("Знайдені номери телефонів:")
for number in phone_numbers:
    print(number.strip()) 
